// задача 1 
//alert("привет из файла js");

// Задание №2 Вычислить результат 158+2 и вывести значение выражения в диалоговое окно

// a= 158;
// b= 2;
// alert(a+b)

// Задание №3 Передать строковый параметр в диалоговое окно. 
// Например, вывести «Привет, Алевтина!», где имя — это передаваемый параметр

// let name1="Алевтина";
// alert(`Привет, ${name1}`);

// Задание №4 Ввызвать диалоговое окно с заголовком 
// «Как вас зовут?» и подсказкой «Имя» в поле ввода. 
// Затем вывести имя, которое ввели.

// const nam=prompt("Как вас зовут? ")
//  alert (`Привет,${ nam}`);

// Задание №5 Написать функцию, выводящую в диалоговом окне текст и переменную. 
// Например, «Привет, Алевтина». Где «Алевтина» — это внешняя переменная

// let name="пользователь"
// alert(`Привет, ${ name}`);
// let secondN=prompt("Как вас зовут? ")
//  alert(`Привет,${secondN}`);

// Задание №6 вывести на экран ****в диалоговом окне текст с сообщением “Вы уверены?” и кнопками «ОК» ,
//  «Отмена».
// При нажатии на кнопку “ОК” вывести в диалоговом окне текст с сообщением 
// “Мы рады, что Вы уверены!”.
// При нажатии на кнопку “Отмена” вывести в диалоговом окне текст с сообщением 
// “Жаль, что Вы не уверены…”.


 // let test = confirm("Правы?")? alert("Мы рады, что Вы уверены!") : alert("Жаль, что Вы не уверены…");

// Задание №7 перепишите код, используя конструкцию switch-case,
//  запрашивая возраст пользователя через диалоговое окно.
  
    // if (age == 18) {
    //     alert('Вы совершеннолетний, все можно!');
    // } else if (age == 10) {
    //     alert('Вам надо учить уроки!');
    // } else if (age == 30) {
    //     alert('Ложитесь спать, завтра на работу');
    // } else {
    //     alert('Мы не знаем что Вам делать');
    // }

//     let age=parseInt(prompt("Введите возраст "));

//    switch(age) 
//    {
//     case 10: alert('Вам надо учить уроки!');
//             break;
//     case 18: alert('Вы совершеннолетний, все можно!');
//             break;
//     case 30: alert('Ложитесь спать, завтра на работу');
//             break;
//     default: alert('Мы не знаем что Вам делать');
//    }

// Задание №8(со звездочкой). Выведите на экран произвольный массив данных.
//  При желании можете его предварительно отсортировать, 
//  как вам будет удобно(по возрастанию или убыванию).

// var m=[23,11,22,45,36];
// m.sort(); // сортировка массива 
// alert(m);
